Revit 2026 API

# ExternalResourceServerExtensions Methods

---

The ExternalResourceServerExtensions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCADLinkOperations | Gets the specific methods supported by external resource CAD Links. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetRevitLinkOperations | Gets the specific methods supported by the external resource of Revit Links. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ExternalResourceServerExtensions Class

Autodesk.Revit.DB Namespace